nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2_Star, [512, False]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2_Star, [1024, False]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11
  - [[-1, 6], 1, Concat, [1]]                          # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                        # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 14
  - [[-1, 4], 1, Concat, [1]]                          # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                        # 16 (P3/8-small)
  - [-1, 1, ECA, [256, 3]]                             # 17 ECA on P3

  - [-1, 1, Conv, [256, 3, 2]]                         # 18
  - [[-1, 13], 1, Concat, [1]]                         # 19 cat head P4
  - [-1, 2, C3k2, [512, False]]                        # 20 (P4/16-medium)
  - [-1, 1, ECA, [512, 3]]                             # 21 ECA on P4

  - [-1, 1, Conv, [512, 3, 2]]                         # 22
  - [[-1, 10], 1, Concat, [1]]                         # 23 cat head P5
  - [-1, 2, C3k2, [1024, True]]                        # 24 (P5/32-large)
  - [-1, 1, ECA, [1024, 3]]                            # 25 ECA on P5

  - [[17, 21, 25], 1, Segment, [nc, 32, 256]]          # 26